#  Sierra Design Automation Inc.
#  write_constraints SDC output
#  User: supandey
#  Host: w32sa05
#  Date: Tue Dec  6 00:02:25 2016


create_clock -name lfxt_clk -period 600 -waveform { 0 300 } [get_pins lfxt_clk_pad/C ]
create_clock -name sysclk_byp -period 600 -waveform { 0 300 } [get_pins  sysclk_byp_pad/C ]
create_clock -name usbclk_byp -period 600 -waveform { 0 300 } [get_pins usbclk_byp_pad/C ]
create_clock -name vsysclk -period 15 -waveform { 0 7.5 }
create_clock -name vsysclk_ddr -period 7.5 -waveform { 0 3.75 }
create_clock -name sysclk -period 2 -waveform { 0 1 } [get_pins i_MAIN_PLL/PLLOUT]
create_clock -name usbclk -period 8 -waveform { 0 4 } [get_pins i_USB_PLL/PLLOUT]


#create_generated_clock -name sysclk -source i_MAIN_PLL/REF -master_clock lfxt_clk -multiply_by 40 -add [get_pins i_MAIN_PLL/PLLOUT]
#create_generated_clock -name usbclk -source i_USB_PLL/REF -master_clock lfxt_clk -multiply_by 6 -add [get_pins i_USB_PLL/PLLOUT]

set_clock_uncertainty -setup 0.2 [get_clocks sysclk]
set_clock_uncertainty -setup 0.1 [get_clocks usbclk]
set_false_path -from [get_ports nmi]
set_false_path -from [get_ports reset_n]
set_input_delay -clock vsysclk 10.5 [get_ports reset_n]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[15] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[14] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[13] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[12] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[11] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[10] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[9] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[8] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[7] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[6] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[5] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[4] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[3] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[2] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[1] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_0[0] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[15] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[14] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[13] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[12] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[11] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[10] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[9] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[8] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[7] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[6] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[5] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[4] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[3] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[2] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[1] }]
set_input_delay -clock vsysclk 10.5 [get_ports { BS_data_1[0] }]
set_input_delay -clock vsysclk 10.5 [get_ports nmi]
set_input_delay -clock vsysclk 10.5 [get_ports scan_mode]
set_input_delay -clock vsysclk 10.5 [get_ports sysclk_byp]
set_input_delay -clock vsysclk 10.5 [get_ports usbclk_byp]
set_output_delay -clock vsysclk 4.5 [get_ports mclk]
set_output_delay -clock vsysclk 4.5 [get_ports BS_ren_0]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[16] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[15] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[14] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[13] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_0[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports BS_ren_1]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[16] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[15] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[14] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[13] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { BS_addr_1[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports ddr0_cke]
set_output_delay -clock vsysclk 4.5 [get_ports ddr0_cs_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr0_we_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr0_cas_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr0_ras_n]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_adr[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_ba[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_ba[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dm[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dm[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dm[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dm[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports ddr1_cke]
set_output_delay -clock vsysclk 4.5 [get_ports ddr1_cs_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr1_we_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr1_cas_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr1_ras_n]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_adr[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_ba[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_ba[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dm[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dm[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dm[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dm[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports ddr2_cke]
set_output_delay -clock vsysclk 4.5 [get_ports ddr2_cs_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr2_we_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr2_cas_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr2_ras_n]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_adr[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_ba[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_ba[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dm[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dm[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dm[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dm[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports ddr3_cke]
set_output_delay -clock vsysclk 4.5 [get_ports ddr3_cs_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr3_we_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr3_cas_n]
set_output_delay -clock vsysclk 4.5 [get_ports ddr3_ras_n]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_adr[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_ba[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_ba[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dm[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dm[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dm[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dm[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[31] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[30] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[29] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[28] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[27] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[26] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[25] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[24] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[23] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[22] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[21] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[20] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[19] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[18] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[17] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[16] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[15] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[14] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[13] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr0_dq[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[31] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[30] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[29] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[28] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[27] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[26] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[25] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[24] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[23] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[22] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[21] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[20] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[19] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[18] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[17] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[16] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[15] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[14] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[13] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr1_dq[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[31] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[30] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[29] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[28] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[27] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[26] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[25] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[24] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[23] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[22] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[21] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[20] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[19] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[18] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[17] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[16] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[15] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[14] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[13] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr2_dq[0] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[31] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[30] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[29] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[28] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[27] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[26] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[25] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[24] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[23] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[22] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[21] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[20] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[19] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[18] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[17] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[16] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[15] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[14] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[13] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[12] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[11] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[10] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[9] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[8] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[7] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[6] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[5] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[4] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[3] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[2] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[1] }]
set_output_delay -clock vsysclk 4.5 [get_ports { ddr3_dq[0] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[31] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[30] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[29] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[28] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[27] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[26] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[25] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[24] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[23] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[22] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[21] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[20] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[19] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[18] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[17] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[16] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[15] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[14] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[13] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[12] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[11] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[10] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[9] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[8] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[7] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[6] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[5] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[4] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[3] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[2] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[1] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr0_dq[0] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[31] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[30] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[29] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[28] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[27] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[26] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[25] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[24] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[23] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[22] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[21] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[20] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[19] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[18] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[17] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[16] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[15] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[14] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[13] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[12] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[11] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[10] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[9] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[8] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[7] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[6] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[5] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[4] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[3] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[2] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[1] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr1_dq[0] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[31] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[30] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[29] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[28] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[27] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[26] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[25] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[24] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[23] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[22] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[21] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[20] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[19] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[18] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[17] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[16] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[15] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[14] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[13] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[12] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[11] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[10] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[9] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[8] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[7] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[6] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[5] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[4] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[3] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[2] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[1] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr2_dq[0] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[31] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[30] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[29] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[28] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[27] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[26] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[25] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[24] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[23] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[22] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[21] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[20] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[19] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[18] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[17] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[16] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[15] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[14] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[13] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[12] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[11] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[10] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[9] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[8] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[7] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[6] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[5] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[4] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[3] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[2] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[1] }]
set_input_delay -clock vsysclk_ddr 5.25 [get_ports { ddr3_dq[0] }]
set_load 10 [get_ports mclk]
set_load 10 [get_ports BS_ren_0]
set_load 10 [get_ports { BS_addr_0[16] }]
set_load 10 [get_ports { BS_addr_0[15] }]
set_load 10 [get_ports { BS_addr_0[14] }]
set_load 10 [get_ports { BS_addr_0[13] }]
set_load 10 [get_ports { BS_addr_0[12] }]
set_load 10 [get_ports { BS_addr_0[11] }]
set_load 10 [get_ports { BS_addr_0[10] }]
set_load 10 [get_ports { BS_addr_0[9] }]
set_load 10 [get_ports { BS_addr_0[8] }]
set_load 10 [get_ports { BS_addr_0[7] }]
set_load 10 [get_ports { BS_addr_0[6] }]
set_load 10 [get_ports { BS_addr_0[5] }]
set_load 10 [get_ports { BS_addr_0[4] }]
set_load 10 [get_ports { BS_addr_0[3] }]
set_load 10 [get_ports { BS_addr_0[2] }]
set_load 10 [get_ports { BS_addr_0[1] }]
set_load 10 [get_ports { BS_addr_0[0] }]
set_load 10 [get_ports BS_ren_1]
set_load 10 [get_ports { BS_addr_1[16] }]
set_load 10 [get_ports { BS_addr_1[15] }]
set_load 10 [get_ports { BS_addr_1[14] }]
set_load 10 [get_ports { BS_addr_1[13] }]
set_load 10 [get_ports { BS_addr_1[12] }]
set_load 10 [get_ports { BS_addr_1[11] }]
set_load 10 [get_ports { BS_addr_1[10] }]
set_load 10 [get_ports { BS_addr_1[9] }]
set_load 10 [get_ports { BS_addr_1[8] }]
set_load 10 [get_ports { BS_addr_1[7] }]
set_load 10 [get_ports { BS_addr_1[6] }]
set_load 10 [get_ports { BS_addr_1[5] }]
set_load 10 [get_ports { BS_addr_1[4] }]
set_load 10 [get_ports { BS_addr_1[3] }]
set_load 10 [get_ports { BS_addr_1[2] }]
set_load 10 [get_ports { BS_addr_1[1] }]
set_load 10 [get_ports { BS_addr_1[0] }]
set_load 10 [get_ports ddr0_cke]
set_load 10 [get_ports ddr0_cs_n]
set_load 10 [get_ports ddr0_we_n]
set_load 10 [get_ports ddr0_cas_n]
set_load 10 [get_ports ddr0_ras_n]
set_load 10 [get_ports { ddr0_adr[12] }]
set_load 10 [get_ports { ddr0_adr[11] }]
set_load 10 [get_ports { ddr0_adr[10] }]
set_load 10 [get_ports { ddr0_adr[9] }]
set_load 10 [get_ports { ddr0_adr[8] }]
set_load 10 [get_ports { ddr0_adr[7] }]
set_load 10 [get_ports { ddr0_adr[6] }]
set_load 10 [get_ports { ddr0_adr[5] }]
set_load 10 [get_ports { ddr0_adr[4] }]
set_load 10 [get_ports { ddr0_adr[3] }]
set_load 10 [get_ports { ddr0_adr[2] }]
set_load 10 [get_ports { ddr0_adr[1] }]
set_load 10 [get_ports { ddr0_adr[0] }]
set_load 10 [get_ports { ddr0_ba[1] }]
set_load 10 [get_ports { ddr0_ba[0] }]
set_load 10 [get_ports { ddr0_dm[3] }]
set_load 10 [get_ports { ddr0_dm[2] }]
set_load 10 [get_ports { ddr0_dm[1] }]
set_load 10 [get_ports { ddr0_dm[0] }]
set_load 10 [get_ports ddr1_cke]
set_load 10 [get_ports ddr1_cs_n]
set_load 10 [get_ports ddr1_we_n]
set_load 10 [get_ports ddr1_cas_n]
set_load 10 [get_ports ddr1_ras_n]
set_load 10 [get_ports { ddr1_adr[12] }]
set_load 10 [get_ports { ddr1_adr[11] }]
set_load 10 [get_ports { ddr1_adr[10] }]
set_load 10 [get_ports { ddr1_adr[9] }]
set_load 10 [get_ports { ddr1_adr[8] }]
set_load 10 [get_ports { ddr1_adr[7] }]
set_load 10 [get_ports { ddr1_adr[6] }]
set_load 10 [get_ports { ddr1_adr[5] }]
set_load 10 [get_ports { ddr1_adr[4] }]
set_load 10 [get_ports { ddr1_adr[3] }]
set_load 10 [get_ports { ddr1_adr[2] }]
set_load 10 [get_ports { ddr1_adr[1] }]
set_load 10 [get_ports { ddr1_adr[0] }]
set_load 10 [get_ports { ddr1_ba[1] }]
set_load 10 [get_ports { ddr1_ba[0] }]
set_load 10 [get_ports { ddr1_dm[3] }]
set_load 10 [get_ports { ddr1_dm[2] }]
set_load 10 [get_ports { ddr1_dm[1] }]
set_load 10 [get_ports { ddr1_dm[0] }]
set_load 10 [get_ports ddr2_cke]
set_load 10 [get_ports ddr2_cs_n]
set_load 10 [get_ports ddr2_we_n]
set_load 10 [get_ports ddr2_cas_n]
set_load 10 [get_ports ddr2_ras_n]
set_load 10 [get_ports { ddr2_adr[12] }]
set_load 10 [get_ports { ddr2_adr[11] }]
set_load 10 [get_ports { ddr2_adr[10] }]
set_load 10 [get_ports { ddr2_adr[9] }]
set_load 10 [get_ports { ddr2_adr[8] }]
set_load 10 [get_ports { ddr2_adr[7] }]
set_load 10 [get_ports { ddr2_adr[6] }]
set_load 10 [get_ports { ddr2_adr[5] }]
set_load 10 [get_ports { ddr2_adr[4] }]
set_load 10 [get_ports { ddr2_adr[3] }]
set_load 10 [get_ports { ddr2_adr[2] }]
set_load 10 [get_ports { ddr2_adr[1] }]
set_load 10 [get_ports { ddr2_adr[0] }]
set_load 10 [get_ports { ddr2_ba[1] }]
set_load 10 [get_ports { ddr2_ba[0] }]
set_load 10 [get_ports { ddr2_dm[3] }]
set_load 10 [get_ports { ddr2_dm[2] }]
set_load 10 [get_ports { ddr2_dm[1] }]
set_load 10 [get_ports { ddr2_dm[0] }]
set_load 10 [get_ports ddr3_cke]
set_load 10 [get_ports ddr3_cs_n]
set_load 10 [get_ports ddr3_we_n]
set_load 10 [get_ports ddr3_cas_n]
set_load 10 [get_ports ddr3_ras_n]
set_load 10 [get_ports { ddr3_adr[12] }]
set_load 10 [get_ports { ddr3_adr[11] }]
set_load 10 [get_ports { ddr3_adr[10] }]
set_load 10 [get_ports { ddr3_adr[9] }]
set_load 10 [get_ports { ddr3_adr[8] }]
set_load 10 [get_ports { ddr3_adr[7] }]
set_load 10 [get_ports { ddr3_adr[6] }]
set_load 10 [get_ports { ddr3_adr[5] }]
set_load 10 [get_ports { ddr3_adr[4] }]
set_load 10 [get_ports { ddr3_adr[3] }]
set_load 10 [get_ports { ddr3_adr[2] }]
set_load 10 [get_ports { ddr3_adr[1] }]
set_load 10 [get_ports { ddr3_adr[0] }]
set_load 10 [get_ports { ddr3_ba[1] }]
set_load 10 [get_ports { ddr3_ba[0] }]
set_load 10 [get_ports { ddr3_dm[3] }]
set_load 10 [get_ports { ddr3_dm[2] }]
set_load 10 [get_ports { ddr3_dm[1] }]
set_load 10 [get_ports { ddr3_dm[0] }]
set_load 10 [get_ports { ddr0_dq[31] }]
set_load 10 [get_ports { ddr0_dq[30] }]
set_load 10 [get_ports { ddr0_dq[29] }]
set_load 10 [get_ports { ddr0_dq[28] }]
set_load 10 [get_ports { ddr0_dq[27] }]
set_load 10 [get_ports { ddr0_dq[26] }]
set_load 10 [get_ports { ddr0_dq[25] }]
set_load 10 [get_ports { ddr0_dq[24] }]
set_load 10 [get_ports { ddr0_dq[23] }]
set_load 10 [get_ports { ddr0_dq[22] }]
set_load 10 [get_ports { ddr0_dq[21] }]
set_load 10 [get_ports { ddr0_dq[20] }]
set_load 10 [get_ports { ddr0_dq[19] }]
set_load 10 [get_ports { ddr0_dq[18] }]
set_load 10 [get_ports { ddr0_dq[17] }]
set_load 10 [get_ports { ddr0_dq[16] }]
set_load 10 [get_ports { ddr0_dq[15] }]
set_load 10 [get_ports { ddr0_dq[14] }]
set_load 10 [get_ports { ddr0_dq[13] }]
set_load 10 [get_ports { ddr0_dq[12] }]
set_load 10 [get_ports { ddr0_dq[11] }]
set_load 10 [get_ports { ddr0_dq[10] }]
set_load 10 [get_ports { ddr0_dq[9] }]
set_load 10 [get_ports { ddr0_dq[8] }]
set_load 10 [get_ports { ddr0_dq[7] }]
set_load 10 [get_ports { ddr0_dq[6] }]
set_load 10 [get_ports { ddr0_dq[5] }]
set_load 10 [get_ports { ddr0_dq[4] }]
set_load 10 [get_ports { ddr0_dq[3] }]
set_load 10 [get_ports { ddr0_dq[2] }]
set_load 10 [get_ports { ddr0_dq[1] }]
set_load 10 [get_ports { ddr0_dq[0] }]
set_load 10 [get_ports { ddr1_dq[31] }]
set_load 10 [get_ports { ddr1_dq[30] }]
set_load 10 [get_ports { ddr1_dq[29] }]
set_load 10 [get_ports { ddr1_dq[28] }]
set_load 10 [get_ports { ddr1_dq[27] }]
set_load 10 [get_ports { ddr1_dq[26] }]
set_load 10 [get_ports { ddr1_dq[25] }]
set_load 10 [get_ports { ddr1_dq[24] }]
set_load 10 [get_ports { ddr1_dq[23] }]
set_load 10 [get_ports { ddr1_dq[22] }]
set_load 10 [get_ports { ddr1_dq[21] }]
set_load 10 [get_ports { ddr1_dq[20] }]
set_load 10 [get_ports { ddr1_dq[19] }]
set_load 10 [get_ports { ddr1_dq[18] }]
set_load 10 [get_ports { ddr1_dq[17] }]
set_load 10 [get_ports { ddr1_dq[16] }]
set_load 10 [get_ports { ddr1_dq[15] }]
set_load 10 [get_ports { ddr1_dq[14] }]
set_load 10 [get_ports { ddr1_dq[13] }]
set_load 10 [get_ports { ddr1_dq[12] }]
set_load 10 [get_ports { ddr1_dq[11] }]
set_load 10 [get_ports { ddr1_dq[10] }]
set_load 10 [get_ports { ddr1_dq[9] }]
set_load 10 [get_ports { ddr1_dq[8] }]
set_load 10 [get_ports { ddr1_dq[7] }]
set_load 10 [get_ports { ddr1_dq[6] }]
set_load 10 [get_ports { ddr1_dq[5] }]
set_load 10 [get_ports { ddr1_dq[4] }]
set_load 10 [get_ports { ddr1_dq[3] }]
set_load 10 [get_ports { ddr1_dq[2] }]
set_load 10 [get_ports { ddr1_dq[1] }]
set_load 10 [get_ports { ddr1_dq[0] }]
set_load 10 [get_ports { ddr2_dq[31] }]
set_load 10 [get_ports { ddr2_dq[30] }]
set_load 10 [get_ports { ddr2_dq[29] }]
set_load 10 [get_ports { ddr2_dq[28] }]
set_load 10 [get_ports { ddr2_dq[27] }]
set_load 10 [get_ports { ddr2_dq[26] }]
set_load 10 [get_ports { ddr2_dq[25] }]
set_load 10 [get_ports { ddr2_dq[24] }]
set_load 10 [get_ports { ddr2_dq[23] }]
set_load 10 [get_ports { ddr2_dq[22] }]
set_load 10 [get_ports { ddr2_dq[21] }]
set_load 10 [get_ports { ddr2_dq[20] }]
set_load 10 [get_ports { ddr2_dq[19] }]
set_load 10 [get_ports { ddr2_dq[18] }]
set_load 10 [get_ports { ddr2_dq[17] }]
set_load 10 [get_ports { ddr2_dq[16] }]
set_load 10 [get_ports { ddr2_dq[15] }]
set_load 10 [get_ports { ddr2_dq[14] }]
set_load 10 [get_ports { ddr2_dq[13] }]
set_load 10 [get_ports { ddr2_dq[12] }]
set_load 10 [get_ports { ddr2_dq[11] }]
set_load 10 [get_ports { ddr2_dq[10] }]
set_load 10 [get_ports { ddr2_dq[9] }]
set_load 10 [get_ports { ddr2_dq[8] }]
set_load 10 [get_ports { ddr2_dq[7] }]
set_load 10 [get_ports { ddr2_dq[6] }]
set_load 10 [get_ports { ddr2_dq[5] }]
set_load 10 [get_ports { ddr2_dq[4] }]
set_load 10 [get_ports { ddr2_dq[3] }]
set_load 10 [get_ports { ddr2_dq[2] }]
set_load 10 [get_ports { ddr2_dq[1] }]
set_load 10 [get_ports { ddr2_dq[0] }]
set_load 10 [get_ports { ddr3_dq[31] }]
set_load 10 [get_ports { ddr3_dq[30] }]
set_load 10 [get_ports { ddr3_dq[29] }]
set_load 10 [get_ports { ddr3_dq[28] }]
set_load 10 [get_ports { ddr3_dq[27] }]
set_load 10 [get_ports { ddr3_dq[26] }]
set_load 10 [get_ports { ddr3_dq[25] }]
set_load 10 [get_ports { ddr3_dq[24] }]
set_load 10 [get_ports { ddr3_dq[23] }]
set_load 10 [get_ports { ddr3_dq[22] }]
set_load 10 [get_ports { ddr3_dq[21] }]
set_load 10 [get_ports { ddr3_dq[20] }]
set_load 10 [get_ports { ddr3_dq[19] }]
set_load 10 [get_ports { ddr3_dq[18] }]
set_load 10 [get_ports { ddr3_dq[17] }]
set_load 10 [get_ports { ddr3_dq[16] }]
set_load 10 [get_ports { ddr3_dq[15] }]
set_load 10 [get_ports { ddr3_dq[14] }]
set_load 10 [get_ports { ddr3_dq[13] }]
set_load 10 [get_ports { ddr3_dq[12] }]
set_load 10 [get_ports { ddr3_dq[11] }]
set_load 10 [get_ports { ddr3_dq[10] }]
set_load 10 [get_ports { ddr3_dq[9] }]
set_load 10 [get_ports { ddr3_dq[8] }]
set_load 10 [get_ports { ddr3_dq[7] }]
set_load 10 [get_ports { ddr3_dq[6] }]
set_load 10 [get_ports { ddr3_dq[5] }]
set_load 10 [get_ports { ddr3_dq[4] }]
set_load 10 [get_ports { ddr3_dq[3] }]
set_load 10 [get_ports { ddr3_dq[2] }]
set_load 10 [get_ports { ddr3_dq[1] }]
set_load 10 [get_ports { ddr3_dq[0] }]
set_load 10 [get_ports usb_plus]
set_load 10 [get_ports usb_minus]
set_input_transition 0.1 [get_ports { ddr0_dq[31] }]
set_input_transition 0.1 [get_ports { ddr0_dq[30] }]
set_input_transition 0.1 [get_ports { ddr0_dq[29] }]
set_input_transition 0.1 [get_ports { ddr0_dq[28] }]
set_input_transition 0.1 [get_ports { ddr0_dq[27] }]
set_input_transition 0.1 [get_ports { ddr0_dq[26] }]
set_input_transition 0.1 [get_ports { ddr0_dq[25] }]
set_input_transition 0.1 [get_ports { ddr0_dq[24] }]
set_input_transition 0.1 [get_ports { ddr0_dq[23] }]
set_input_transition 0.1 [get_ports { ddr0_dq[22] }]
set_input_transition 0.1 [get_ports { ddr0_dq[21] }]
set_input_transition 0.1 [get_ports { ddr0_dq[20] }]
set_input_transition 0.1 [get_ports { ddr0_dq[19] }]
set_input_transition 0.1 [get_ports { ddr0_dq[18] }]
set_input_transition 0.1 [get_ports { ddr0_dq[17] }]
set_input_transition 0.1 [get_ports { ddr0_dq[16] }]
set_input_transition 0.1 [get_ports { ddr0_dq[15] }]
set_input_transition 0.1 [get_ports { ddr0_dq[14] }]
set_input_transition 0.1 [get_ports { ddr0_dq[13] }]
set_input_transition 0.1 [get_ports { ddr0_dq[12] }]
set_input_transition 0.1 [get_ports { ddr0_dq[11] }]
set_input_transition 0.1 [get_ports { ddr0_dq[10] }]
set_input_transition 0.1 [get_ports { ddr0_dq[9] }]
set_input_transition 0.1 [get_ports { ddr0_dq[8] }]
set_input_transition 0.1 [get_ports { ddr0_dq[7] }]
set_input_transition 0.1 [get_ports { ddr0_dq[6] }]
set_input_transition 0.1 [get_ports { ddr0_dq[5] }]
set_input_transition 0.1 [get_ports { ddr0_dq[4] }]
set_input_transition 0.1 [get_ports { ddr0_dq[3] }]
set_input_transition 0.1 [get_ports { ddr0_dq[2] }]
set_input_transition 0.1 [get_ports { ddr0_dq[1] }]
set_input_transition 0.1 [get_ports { ddr0_dq[0] }]
set_input_transition 0.1 [get_ports { ddr1_dq[31] }]
set_input_transition 0.1 [get_ports { ddr1_dq[30] }]
set_input_transition 0.1 [get_ports { ddr1_dq[29] }]
set_input_transition 0.1 [get_ports { ddr1_dq[28] }]
set_input_transition 0.1 [get_ports { ddr1_dq[27] }]
set_input_transition 0.1 [get_ports { ddr1_dq[26] }]
set_input_transition 0.1 [get_ports { ddr1_dq[25] }]
set_input_transition 0.1 [get_ports { ddr1_dq[24] }]
set_input_transition 0.1 [get_ports { ddr1_dq[23] }]
set_input_transition 0.1 [get_ports { ddr1_dq[22] }]
set_input_transition 0.1 [get_ports { ddr1_dq[21] }]
set_input_transition 0.1 [get_ports { ddr1_dq[20] }]
set_input_transition 0.1 [get_ports { ddr1_dq[19] }]
set_input_transition 0.1 [get_ports { ddr1_dq[18] }]
set_input_transition 0.1 [get_ports { ddr1_dq[17] }]
set_input_transition 0.1 [get_ports { ddr1_dq[16] }]
set_input_transition 0.1 [get_ports { ddr1_dq[15] }]
set_input_transition 0.1 [get_ports { ddr1_dq[14] }]
set_input_transition 0.1 [get_ports { ddr1_dq[13] }]
set_input_transition 0.1 [get_ports { ddr1_dq[12] }]
set_input_transition 0.1 [get_ports { ddr1_dq[11] }]
set_input_transition 0.1 [get_ports { ddr1_dq[10] }]
set_input_transition 0.1 [get_ports { ddr1_dq[9] }]
set_input_transition 0.1 [get_ports { ddr1_dq[8] }]
set_input_transition 0.1 [get_ports { ddr1_dq[7] }]
set_input_transition 0.1 [get_ports { ddr1_dq[6] }]
set_input_transition 0.1 [get_ports { ddr1_dq[5] }]
set_input_transition 0.1 [get_ports { ddr1_dq[4] }]
set_input_transition 0.1 [get_ports { ddr1_dq[3] }]
set_input_transition 0.1 [get_ports { ddr1_dq[2] }]
set_input_transition 0.1 [get_ports { ddr1_dq[1] }]
set_input_transition 0.1 [get_ports { ddr1_dq[0] }]
set_input_transition 0.1 [get_ports { ddr2_dq[31] }]
set_input_transition 0.1 [get_ports { ddr2_dq[30] }]
set_input_transition 0.1 [get_ports { ddr2_dq[29] }]
set_input_transition 0.1 [get_ports { ddr2_dq[28] }]
set_input_transition 0.1 [get_ports { ddr2_dq[27] }]
set_input_transition 0.1 [get_ports { ddr2_dq[26] }]
set_input_transition 0.1 [get_ports { ddr2_dq[25] }]
set_input_transition 0.1 [get_ports { ddr2_dq[24] }]
set_input_transition 0.1 [get_ports { ddr2_dq[23] }]
set_input_transition 0.1 [get_ports { ddr2_dq[22] }]
set_input_transition 0.1 [get_ports { ddr2_dq[21] }]
set_input_transition 0.1 [get_ports { ddr2_dq[20] }]
set_input_transition 0.1 [get_ports { ddr2_dq[19] }]
set_input_transition 0.1 [get_ports { ddr2_dq[18] }]
set_input_transition 0.1 [get_ports { ddr2_dq[17] }]
set_input_transition 0.1 [get_ports { ddr2_dq[16] }]
set_input_transition 0.1 [get_ports { ddr2_dq[15] }]
set_input_transition 0.1 [get_ports { ddr2_dq[14] }]
set_input_transition 0.1 [get_ports { ddr2_dq[13] }]
set_input_transition 0.1 [get_ports { ddr2_dq[12] }]
set_input_transition 0.1 [get_ports { ddr2_dq[11] }]
set_input_transition 0.1 [get_ports { ddr2_dq[10] }]
set_input_transition 0.1 [get_ports { ddr2_dq[9] }]
set_input_transition 0.1 [get_ports { ddr2_dq[8] }]
set_input_transition 0.1 [get_ports { ddr2_dq[7] }]
set_input_transition 0.1 [get_ports { ddr2_dq[6] }]
set_input_transition 0.1 [get_ports { ddr2_dq[5] }]
set_input_transition 0.1 [get_ports { ddr2_dq[4] }]
set_input_transition 0.1 [get_ports { ddr2_dq[3] }]
set_input_transition 0.1 [get_ports { ddr2_dq[2] }]
set_input_transition 0.1 [get_ports { ddr2_dq[1] }]
set_input_transition 0.1 [get_ports { ddr2_dq[0] }]
set_input_transition 0.1 [get_ports { ddr3_dq[31] }]
set_input_transition 0.1 [get_ports { ddr3_dq[30] }]
set_input_transition 0.1 [get_ports { ddr3_dq[29] }]
set_input_transition 0.1 [get_ports { ddr3_dq[28] }]
set_input_transition 0.1 [get_ports { ddr3_dq[27] }]
set_input_transition 0.1 [get_ports { ddr3_dq[26] }]
set_input_transition 0.1 [get_ports { ddr3_dq[25] }]
set_input_transition 0.1 [get_ports { ddr3_dq[24] }]
set_input_transition 0.1 [get_ports { ddr3_dq[23] }]
set_input_transition 0.1 [get_ports { ddr3_dq[22] }]
set_input_transition 0.1 [get_ports { ddr3_dq[21] }]
set_input_transition 0.1 [get_ports { ddr3_dq[20] }]
set_input_transition 0.1 [get_ports { ddr3_dq[19] }]
set_input_transition 0.1 [get_ports { ddr3_dq[18] }]
set_input_transition 0.1 [get_ports { ddr3_dq[17] }]
set_input_transition 0.1 [get_ports { ddr3_dq[16] }]
set_input_transition 0.1 [get_ports { ddr3_dq[15] }]
set_input_transition 0.1 [get_ports { ddr3_dq[14] }]
set_input_transition 0.1 [get_ports { ddr3_dq[13] }]
set_input_transition 0.1 [get_ports { ddr3_dq[12] }]
set_input_transition 0.1 [get_ports { ddr3_dq[11] }]
set_input_transition 0.1 [get_ports { ddr3_dq[10] }]
set_input_transition 0.1 [get_ports { ddr3_dq[9] }]
set_input_transition 0.1 [get_ports { ddr3_dq[8] }]
set_input_transition 0.1 [get_ports { ddr3_dq[7] }]
set_input_transition 0.1 [get_ports { ddr3_dq[6] }]
set_input_transition 0.1 [get_ports { ddr3_dq[5] }]
set_input_transition 0.1 [get_ports { ddr3_dq[4] }]
set_input_transition 0.1 [get_ports { ddr3_dq[3] }]
set_input_transition 0.1 [get_ports { ddr3_dq[2] }]
set_input_transition 0.1 [get_ports { ddr3_dq[1] }]
set_input_transition 0.1 [get_ports { ddr3_dq[0] }]
set_input_transition 0.1 [get_ports usb_plus]
set_input_transition 0.1 [get_ports usb_minus]
set_input_transition 0.1 [get_ports reset_n]
set_input_transition 0.1 [get_ports { BS_data_0[15] }]
set_input_transition 0.1 [get_ports { BS_data_0[14] }]
set_input_transition 0.1 [get_ports { BS_data_0[13] }]
set_input_transition 0.1 [get_ports { BS_data_0[12] }]
set_input_transition 0.1 [get_ports { BS_data_0[11] }]
set_input_transition 0.1 [get_ports { BS_data_0[10] }]
set_input_transition 0.1 [get_ports { BS_data_0[9] }]
set_input_transition 0.1 [get_ports { BS_data_0[8] }]
set_input_transition 0.1 [get_ports { BS_data_0[7] }]
set_input_transition 0.1 [get_ports { BS_data_0[6] }]
set_input_transition 0.1 [get_ports { BS_data_0[5] }]
set_input_transition 0.1 [get_ports { BS_data_0[4] }]
set_input_transition 0.1 [get_ports { BS_data_0[3] }]
set_input_transition 0.1 [get_ports { BS_data_0[2] }]
set_input_transition 0.1 [get_ports { BS_data_0[1] }]
set_input_transition 0.1 [get_ports { BS_data_0[0] }]
set_input_transition 0.1 [get_ports { BS_data_1[15] }]
set_input_transition 0.1 [get_ports { BS_data_1[14] }]
set_input_transition 0.1 [get_ports { BS_data_1[13] }]
set_input_transition 0.1 [get_ports { BS_data_1[12] }]
set_input_transition 0.1 [get_ports { BS_data_1[11] }]
set_input_transition 0.1 [get_ports { BS_data_1[10] }]
set_input_transition 0.1 [get_ports { BS_data_1[9] }]
set_input_transition 0.1 [get_ports { BS_data_1[8] }]
set_input_transition 0.1 [get_ports { BS_data_1[7] }]
set_input_transition 0.1 [get_ports { BS_data_1[6] }]
set_input_transition 0.1 [get_ports { BS_data_1[5] }]
set_input_transition 0.1 [get_ports { BS_data_1[4] }]
set_input_transition 0.1 [get_ports { BS_data_1[3] }]
set_input_transition 0.1 [get_ports { BS_data_1[2] }]
set_input_transition 0.1 [get_ports { BS_data_1[1] }]
set_input_transition 0.1 [get_ports { BS_data_1[0] }]
set_input_transition 0.1 [get_ports lfxt_clk]
set_input_transition 0.1 [get_ports nmi]
set_input_transition 0.1 [get_ports scan_mode]
set_input_transition 0.1 [get_ports sysclk_byp]
set_input_transition 0.1 [get_ports usbclk_byp]
set_case_analysis 0 [get_ports scan_mode]
set_input_delay 0.7 [get_ports usb_minus]
set_input_delay 0.7 [get_ports usb_plus]
set_clock_groups -name CLOCK_GROUP__0 -asynchronous  -group  [get_clocks lfxt_clk] -group  [get_clocks sysclk] -group  [get_clocks usbclk]



